runWaterCooler/1_icoFoam/solid/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
/*
    outlet
    {
        type                inletOutlet;
        inletValue          uniform 0;
        value               uniform 0;
    }

*/
    out
    {
        type                fixedValue;
        value               uniform 0;
    }
    interfaceOut
    {
        type                mapped;
      //  field                 U;
        value               uniform 0;
        interpolationScheme cell;
        setAverage          false;
        average             0;
    }
    fixedWalls
    {
        type                fixedValue;
        value               uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
